{
  "main": {
    "name":"Zeyu Liu",
    "occupation":"Full-Stack Web Developer",
    "description":"My desire to continuously learn will always be my greatest strength. Currently looking for a full-stack role.",
    "image":"avatar.png",
    "bio":"Hi! I am a full stack web developer with a background in finance and e-commerce. After I graduated from the University of Waterloo, I started off my career as a Trade Control Analyst for CIBC. Along the way, I ventured off in the field of e-commerce and was able to find sucess and established my own company; Ikigai & Soul ®. As sales grew, I commited myself to being an entrepreneur full time and left my job at CIBC after a memorable year. Some would call it fate, as my decision to become a business owner is what led me to discover my passion for programming. Managaing an online store meant I would not only have to tend to the business side, but also issues behind the scenes. I started playing around with tweaking small snippets of HTML/Javascript to implement basic design changes for my website. As my interest grew stronger, there were more and more features I wanted to implement but did not have the knowledge to. That's when I decided to enroll in the 12 week web development bootcamp at Lighthouse Labs. As the founder of a mid-sized e-commerce company,  I am passionate about creating seamless user interfaces that can generate maximum results. That passion along with my 3 years of experience in the financial industry, has given me the skills to bridge the gap between business and technology.",

    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "haozai_03@hotmail.com",
    "phone": "416-809-7087",
    "address":{
      "city":"Toronto"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://resume.creddle.io/resume/3tgsfsza97m",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/zeyu-liu-8a899886/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/z79liu",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Front-End: React, HTML, CSS, Bootstrap ",
    "skillmessageBack": "Back-End: Node.JS, Ruby on Rails, Sequelize, PostgreSQL",

    "education":[
      {
        "school":"Lighthouse Labs",
        "degree":"Diploma, Web Development",
        "graduated":"May 2019",
        "description":"Built numerous projects with Node.js & Ruby on Rails framework. Developed a deep understanding of database Modelling and Software Architecture. "
      },
      {
        "school":"University of Waterloo",
        "degree":"Bachelors: Mathematics - Economics/Finance ",
        "graduated":"April 2016",
        "description":"Completed a four year degree with speclizaition in Finance"
      }
    ],
    "work":[
      {
        "company":"Awesome Design Studio",
        "title":"Senior UX God ",
        "years":"March 2010 - Present",
        "description":"Describe work, special projects, notable achievements, what technologies you have been working with, and anything else that would be useful for an employer to know."
      },
      {
        "company":"Super Cool Studio",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Describe work, special projects, notable achievements, what technologies you have been working with, and anything else that would be useful for an employer to know."
      }
    ],
    "skills":[ {
      "name":"Node.js",
      "url":"public/images/nodejs.png"
    },
    {
      "name":"ExpressJs",
      "url":"public/images/nodejs.png"
    }
  
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"roomR",
        "category": "Optimized Roomate finding App built on Express",
        "image":"roomR.jpeg",
        "description" : "Colobration project that looks to simplify the roomate finding experience based on personality. Built using NodeJs, Express, Sequelize, Google Maps API & TalkJS API",
        "url":"https://github.com/z79liu/roomR"
      },
      {
        "title":"Drac's Snack",
        "category":"A Simplified online food ordering app",
        "description" : "A web app that simplifies online food ordering. Built on Node.js, Express, Knex, PostgresSQL & Twilio API.",
        "image":"home-page.png",
        "url":"https://github.com/z79liu/Drac-s-Snack-"
      },
      {
        "title":"Chatty App",
        "category":"SPA chat app built with react and websocket",
        "image":"chatty.gif",
        "description" : "A client-side SPA (single-page app) built with ReactJS, Webpack, Babel, Node.js and Web Sockets. The client-side app communicates with a server via WebSockets for multi-user real-time updates. No persistent database is involved; the focus is on the client-side experience and using ReactJS for real time updates.",
        "url":"https://github.com/z79liu/Chatty-App"
      },
      {
        "title":"Tweeter",
        "category":"A Single Page Twitter Clone",
        "image":"tweeter.png",
        "description": "Twitter clone app using MongoDB & Express",
        "url":"https://github.com/z79liu/tweeter"
      },
      {
        "title":"Jungle",
        "category":"A e-commerce web app built w/ Ruby on Rails.",
        "image":"jungle.png",
        "description": "E-Commerce App built on Ruby on Rails",
        "url":"https://github.com/z79liu/jungle-rails"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"The starting point of all achievement is desire",
        "user":"Napoleon Hill"
      }
    ]
  }
}
